artillery-tests/test-script.yml
config:
  target: "http://localhost:3000"  # Replace with your application's base URL
  phases:
    - duration: 60         # Total duration of the test in seconds
      arrivalRate: 10      # Number of new virtual users per second
  payload:
    path: "./users.csv"
    fields:
      - "username"
      - "password"
  variables:
    imagePath: "./test-image.jpg"  # Path to your test image
  http:
    timeout: 60
    followRedirects: true
  processor: "./functions.js"
scenarios:
  - name: "User Workflow"
    flow:
      - log: "Attempting login for user: {{ username }}"
      - post:
          url: "/login"  # Update with your actual login endpoint
          form:
            username: "{{ username }}"
            password: "{{ password }}"
          expect:
            - statusCode: 200
      - think: 1  # Optional pause between actions (in seconds)
      - loop:
          count: 20
          do:
            - function: "generateFormData"
            - post:
                url: "/upload"  # Update with your actual upload endpoint
                headers:
                  # If your app uses token-based authentication, include the token
                  # Authorization: "Bearer {{ authToken }}"
                multipartFormData:
                  id_user: "{{ formData.id_user }}"
                  id_tipe_lantai: "{{ formData.id_tipe_lantai }}"
                  id_tipe_aset: "{{ formData.id_tipe_aset }}"
                  id_tipe_hb: "{{ formData.id_tipe_hb }}"
                  id_tipe_door: "{{ formData.id_tipe_door }}"
                  id_kondisi: "{{ formData.id_kondisi }}"
                  catatan: "{{ formData.catatan }}"
                  clientTimestamp: "{{ formData.clientTimestamp }}"
                  foto:
                    file: "{{ formData.foto }}"
                expect:
                  - statusCode: 200
            - think: 1